_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 25, 25, 15, 1)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 23, 23, 9, 8)      512       
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 21, 21, 5, 16)     5776      
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 19, 19, 3, 32)     13856     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 17, 17, 1, 64)     55360     
_________________________________________________________________
flatten_1 (Flatten)          (None, 18496)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               4735232   
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 16)                2064      
=================================================================
Total params: 4,845,696
Trainable params: 4,845,696
Non-trainable params: 0
_________________________________________________________________